src/config/DataProcessors/ИнструментПроведениеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<DataProcessor>
		<Properties>
			<Name>ИнструментПроведениеДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтостартПроведенияПриОткрытии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПропускатьНепроведенные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжатьПриБлокировке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезаполнятьАвтоматическиПриСдвигеПоследовательностиНазад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пауза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СписокДокументовДляПроведения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаДокумента</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПроведения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗатраченоВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проводить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

src/config/DataProcessors/ИнструментПроведениеДокументов/Ext/ObjectModule.bsl
Процедура ЗаполнитьПоследовательностьНаСервере() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПартииЗапасовГраницы.Период КАК Период,
	|	ПартииЗапасовГраницы.Регистратор КАК Регистратор,
	|	ПартииЗапасовГраницы.МоментВремени КАК МоментВремени
	|ПОМЕСТИТЬ Границы
	|ИЗ
	|	Последовательность.ПартииЗапасов.Границы КАК ПартииЗапасовГраницы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период,
	|	МоментВремени
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПартииЗапасов.Период КАК Период,
	|	ПартииЗапасов.Регистратор.Дата КАК ДатаДокумента,
	|	ПартииЗапасов.Регистратор КАК Документ,
	|	ИСТИНА КАК Проводить,
	|	ПартииЗапасов.МоментВремени КАК МоментВремени
	|ИЗ
	|	Границы КАК Границы,
	|	Последовательность.ПартииЗапасов КАК ПартииЗапасов
	|ГДЕ
	|	ПартииЗапасов.МоментВремени > Границы.МоментВремени
	|	И ПартииЗапасов.Регистратор.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	МоментВремени";
	
	СписокДокументовДляПроведения.Загрузить(Запрос.Выполнить().Выгрузить());

КонецПроцедуры

Процедура СкорректироватьПриходныеНакладные() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВложенныйЗапрос.Период КАК ДатаДокумента,
	|	ВложенныйЗапрос.Регистратор КАК Документ,
	|	ИСТИНА КАК Проводить
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЗапасыКРасходуСоСкладов.Регистратор КАК Регистратор,
	|		ЗапасыКРасходуСоСкладов.Период КАК Период
	|	ИЗ
	|		РегистрНакопления.ЗапасыКРасходуСоСкладов КАК ЗапасыКРасходуСоСкладов
	|	ГДЕ
	|		НЕ ЗапасыКРасходуСоСкладов.Регистратор ССЫЛКА Документ.РасходныйОрдер
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ЗапасыКПоступлениюНаСклады.Регистратор,
	|		ЗапасыКПоступлениюНаСклады.Период
	|	ИЗ
	|		РегистрНакопления.ЗапасыКПоступлениюНаСклады КАК ЗапасыКПоступлениюНаСклады
	|	ГДЕ
	|		НЕ ЗапасыКПоступлениюНаСклады.Регистратор ССЫЛКА Документ.ПриходныйОрдер
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПриходнаяНакладнаяЗапасы.Ссылка,
	|		ПриходнаяНакладнаяЗапасы.Ссылка.Дата
	|	ИЗ
	|		Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|	ГДЕ
	|		ПриходнаяНакладнаяЗапасы.Партия = ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|		И ПриходнаяНакладнаяЗапасы.Ссылка.Проведен) КАК ВложенныйЗапрос
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДокумента,
	|	Документ";
	
	СписокДокументовДляПроведения.Загрузить(Запрос.Выполнить().Выгрузить());
	
	
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтруктурныеЕдиницы.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|ГДЕ
	|	СтруктурныеЕдиницы.ОрдерныйСклад";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекОб = Выборка.Ссылка.ПолучитьОбъект();
		ТекОб.ОрдерныйСклад = Ложь;
		ТекОб.Записать();
	КонецЦикла;
	
	Константы.ФункциональнаяОпцияИспользоватьОрдерныйСклад.Установить(Ложь);
КонецПроцедуры

Функция УдалитьЛишниеПартии() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПартииНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ПартииНоменклатуры КАК ПартииНоменклатуры
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходнаяНакладная.Запасы КАК ПриходнаяНакладнаяЗапасы
	|		ПО ПартииНоменклатуры.Ссылка = ПриходнаяНакладнаяЗапасы.Партия
	|ГДЕ
	|	ПриходнаяНакладнаяЗапасы.Ссылка ЕСТЬ NULL
	|	И НЕ ПартииНоменклатуры.ПометкаУдаления";

	Ном = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ТекОб = Выборка.Ссылка.ПолучитьОбъект();
		ТекОб.УстановитьПометкуУдаления(Истина);
		Ном = Ном + 1;
	КонецЦикла;
	
	Возврат Ном;
КонецФункции
